In [2]:
import pandas as pd

In [3]:
orders_df = pd.read_csv("assets/orders.csv")
orders_df.head()

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982.0,محمود آباد,1.0
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000.0,خرمدره,1.0
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358.0,قرچک,1.0
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514.0,قم,1.0
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028.0,تهران,1.0

In [4]:
orders_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  str
 4   Amount_Gross_Order     200000 non-null  float64
 5   city_name_fa           200000 non-null  str
 6   Quantity_item          200000 non-null  float64
dtypes: float64(2), int64(3), str(2)
memory usage: 17.0 MB

In [5]:
# converting str to datetime for the order date column
orders_df.DateTime_CartFinalize = orders_df.DateTime_CartFinalize.astype('datetime64[ns]')

In [6]:
# فاصله زمانی این دیتاست: کم‌ترین زمان تا بیشترین زمان
min_date = orders_df.DateTime_CartFinalize.min()
max_date = orders_df.DateTime_CartFinalize.max()
print(f"Dataset Time Period: from {min_date} to {max_date}")

Dataset Time Period: from 2013-09-27 12:03:00 to 2018-12-11 04:47:23

In [7]:
# به دست آوردن تاریخ آخرین خرید هر مشتری
orders_df['last_transaction_date'] = orders_df.groupby('ID_Customer')['DateTime_CartFinalize'].transform(max)
orders_df

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,last_transaction_date
0,2714054,469662,21386,2015-10-15 08:50:56,597982.0,محمود آباد,1.0,2018-07-08 10:48:54
1,11104039,3063877,248497,2018-02-11 00:29:26,980000.0,خرمدره,1.0,2018-02-11 00:29:26
2,4228130,3184893,50144,2016-06-14 00:30:08,229358.0,قرچک,1.0,2016-12-21 13:40:12
3,22225624,6888562,70208,2018-09-03 14:37:19,16514.0,قم,1.0,2018-09-03 14:37:19
4,4068771,2533490,67627,2016-05-21 11:51:02,133028.0,تهران,1.0,2016-05-21 11:51:02
...,...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01,344037.0,تهران,2.0,2018-04-03 12:07:01
199996,4425393,3745774,131645,2016-07-09 19:14:09,600000.0,محمدیه,1.0,2016-07-09 19:14:09
199997,6671889,4845514,215045,2017-03-08 23:47:06,450000.0,اصفهان,1.0,2017-03-08 23:47:06
199998,6315995,2541418,264021,2017-02-08 14:59:39,193486.0,همدان,1.0,2017-12-21 00:42:47
199999,7584127,1342585,89427,2017-06-17 10:08:06,55046.0,بندر انزلی,1.0,2017-09-25 15:31:40

In [8]:
# Making sure last_trancation_date is correct for a random customer
orders_df[orders_df.ID_Customer == 469662 ]

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,last_transaction_date
0,2714054,469662,21386,2015-10-15 08:50:56,597982.0,محمود آباد,1.0,2018-07-08 10:48:54
18657,4108025,469662,165970,2016-05-27 13:09:16,141826.0,محمود آباد,1.0,2018-07-08 10:48:54
30887,4108025,469662,167534,2016-05-27 13:09:16,82569.0,محمود آباد,1.0,2018-07-08 10:48:54
45054,4266993,469662,64680,2016-06-19 17:33:03,82569.0,محمود آباد,1.0,2018-07-08 10:48:54
166816,13936681,469662,407265,2018-07-08 10:48:54,18349.0,محمود آباد,5.0,2018-07-08 10:48:54
177264,2365593,469662,66728,2015-07-30 15:30:39,100917.0,محمود آباد,1.0,2018-07-08 10:48:54

In [9]:
# Creating a new DF for RFM values for each customer
rfm_df = pd.DataFrame(pd.unique(orders_df.ID_Customer), columns=['Customer_ID'])
rfm_df

        Customer_ID
0            469662
1           3063877
2           3184893
3           6888562
4           2533490
...             ...
151629      4625961
151630      3720408
151631      4403268
151632      3745774
151633      4845514

[151634 rows x 1 columns]

In [10]:
# Calculating the R value for each customer
rfm_df['r_value'] = (pd.to_datetime('2019-01-01') - orders_df.last_transaction_date).dt.days
rfm_df['r_value']

0         176
1         323
2         740
3         119
4         954
         ...
151629    376
151630    869
151631    195
151632    108
151633    252
Name: r_value, Length: 151634, dtype: int64

In [11]:
# Calculating the F value for each customer
rfm_df['f_value'] = orders_df.groupby('ID_Customer')['DateTime_CartFinalize'].transform('count')
rfm_df

        Customer_ID  r_value  f_value
0            469662      176        6
1           3063877      323        1
2           3184893      740        3
3           6888562      119        1
4           2533490      954        1
...             ...      ...      ...
151629      4625961      376        2
151630      3720408      869        2
151631      4403268      195        1
151632      3745774      108        1
151633      4845514      252        1

[151634 rows x 3 columns]

In [12]:
# Calculating the M value for each customer
sum_sales_amount = orders_df.groupby('ID_Customer')['Amount_Gross_Order'].transform(sum)
sum_quantities = orders_df.groupby('ID_Customer')['Quantity_item'].transform(sum)

rfm_df['m_value'] = sum_sales_amount / sum_quantities
rfm_df

        Customer_ID  r_value  f_value       m_value
0            469662      176        6  1.024212e+05
1           3063877      323        1  9.800000e+05
2           3184893      740        3  1.732570e+05
3           6888562      119        1  1.651400e+04
4           2533490      954        1  1.330280e+05
...             ...      ...      ...           ...
151629      4625961      376        2  1.143394e+06
151630      3720408      869        2  1.000816e+05
151631      4403268      195        1  3.800000e+05
151632      3745774      108        1  6.200000e+05
151633      4845514      252        1  5.030583e+04

[151634 rows x 4 columns]

In [13]:
# Calculating the R score based on percentiles
rfm_df['r_score'] = rfm_df['r_value'].case_when(
    caselist=[
        (rfm_df['r_value'] <= rfm_df['r_value'].quantile(0.20), "5"),
        (rfm_df['r_value'] <= rfm_df['r_value'].quantile(0.40), "4"),
        (rfm_df['r_value'] <= rfm_df['r_value'].quantile(0.60), "3"),
        (rfm_df['r_value'] <= rfm_df['r_value'].quantile(0.80), "2"),
        (pd.Series(True), "1")
    ]
)

# Calculating the F score based on percentiles
rfm_df['f_score'] = rfm_df['f_value'].case_when(
    caselist=[
        (rfm_df['f_value'] <= rfm_df['f_value'].quantile(0.20), "1"),
        (rfm_df['f_value'] <= rfm_df['f_value'].quantile(0.40), "2"),
        (rfm_df['f_value'] <= rfm_df['f_value'].quantile(0.60), "3"),
        (rfm_df['f_value'] <= rfm_df['f_value'].quantile(0.80), "4"),
        (pd.Series(True), "5")
    ]
)

# Calculating the M score based on percentiles
rfm_df['m_score'] = rfm_df['m_value'].case_when(
    caselist=[
        (rfm_df['m_value'] <= rfm_df['m_value'].quantile(0.20), "1"),
        (rfm_df['m_value'] <= rfm_df['m_value'].quantile(0.40), "2"),
        (rfm_df['m_value'] <= rfm_df['m_value'].quantile(0.60), "3"),
        (rfm_df['m_value'] <= rfm_df['m_value'].quantile(0.80), "4"),
        (pd.Series(True), "5")
    ]
)

rfm_df

        Customer_ID  r_value  f_value       m_value r_score f_score m_score
0            469662      176        6  1.024212e+05       4       5       1
1           3063877      323        1  9.800000e+05       3       1       4
2           3184893      740        3  1.732570e+05       2       5       2
3           6888562      119        1  1.651400e+04       5       1       1
4           2533490      954        1  1.330280e+05       1       1       2
...             ...      ...      ...           ...     ...     ...     ...
151629      4625961      376        2  1.143394e+06       3       4       4
151630      3720408      869        2  1.000816e+05       1       4       1
151631      4403268      195        1  3.800000e+05       4       1       3
151632      3745774      108        1  6.200000e+05       5       1       4
151633      4845514      252        1  5.030583e+04       4       1       1

[151634 rows x 7 columns]

In [14]:
# Calculating the final RFM score based on concatenating the r_score, f_score and m_score
rfm_df['rfm_score'] = rfm_df.r_score + rfm_df.f_score + rfm_df.m_score
rfm_df

,Customer_ID,r_value,f_value,m_value,r_score,f_score,m_score,rfm_score
0,469662,176,6,1.024212e+05,4,5,1,451
1,3063877,323,1,9.800000e+05,3,1,4,314
2,3184893,740,3,1.732570e+05,2,5,2,252
3,6888562,119,1,1.651400e+04,5,1,1,511
4,2533490,954,1,1.330280e+05,1,1,2,112
...,...,...,...,...,...,...,...,...
151629,4625961,376,2,1.143394e+06,3,4,4,344
151630,3720408,869,2,1.000816e+05,1,4,1,141
151631,4403268,195,1,3.800000e+05,4,1,3,413
151632,3745774,108,1,6.200000e+05,5,1,4,514
151633,4845514,252,1,5.030583e+04,4,1,1,411

In [15]:
# Reading the RFM scores mapping table
rfm_mapping = pd.read_excel("assets/RFM-Groups-Mapping.xlsx")
rfm_mapping['RFM Score'] = rfm_mapping['RFM Score'].astype('str')
rfm_mapping

         Group RFM Score  Index
0    Champions       555      1
1    Champions       554      1
2    Champions       544      1
3    Champions       545      1
4    Champions       454      1
..         ...       ...    ...
123       Lost       112     11
124       Lost       121     11
125       Lost       131     11
126       Lost       141     11
127       Lost       151     11

[128 rows x 3 columns]

In [16]:
rfm_mapping.info()

<class 'pandas.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Group      128 non-null    str
 1   RFM Score  128 non-null    str
 2   Index      128 non-null    int64
dtypes: int64(1), str(2)
memory usage: 5.0 KB

In [17]:
# joining the two data for group labels
rfm_df = rfm_df.merge(rfm_mapping, left_on='rfm_score', right_on='RFM Score' , how='inner')
rfm_df

,Customer_ID,r_value,f_value,m_value,r_score,f_score,m_score,rfm_score,Group,RFM Score,Index
0,469662,176,6,1.024212e+05,4,5,1,451,Potential Loyalists,451,3
1,3063877,323,1,9.800000e+05,3,1,4,314,Promising,314,5
2,3184893,740,3,1.732570e+05,2,5,2,252,At Risk,252,8
3,6888562,119,1,1.651400e+04,5,1,1,511,New Customers,511,4
4,2533490,954,1,1.330280e+05,1,1,2,112,Lost,112,11
...,...,...,...,...,...,...,...,...,...,...,...
153462,4625961,376,2,1.143394e+06,3,4,4,344,Loyal Customers,344,2
153463,3720408,869,2,1.000816e+05,1,4,1,141,Lost,141,11
153464,4403268,195,1,3.800000e+05,4,1,3,413,Promising,413,5
153465,3745774,108,1,6.200000e+05,5,1,4,514,Promising,514,5
153466,4845514,252,1,5.030583e+04,4,1,1,411,New Customers,411,4

In [18]:
rfm_df.drop(columns=['RFM Score'], inplace= True)
rfm_df

,Customer_ID,r_value,f_value,m_value,r_score,f_score,m_score,rfm_score,Group,Index
0,469662,176,6,1.024212e+05,4,5,1,451,Potential Loyalists,3
1,3063877,323,1,9.800000e+05,3,1,4,314,Promising,5
2,3184893,740,3,1.732570e+05,2,5,2,252,At Risk,8
3,6888562,119,1,1.651400e+04,5,1,1,511,New Customers,4
4,2533490,954,1,1.330280e+05,1,1,2,112,Lost,11
...,...,...,...,...,...,...,...,...,...,...
153462,4625961,376,2,1.143394e+06,3,4,4,344,Loyal Customers,2
153463,3720408,869,2,1.000816e+05,1,4,1,141,Lost,11
153464,4403268,195,1,3.800000e+05,4,1,3,413,Promising,5
153465,3745774,108,1,6.200000e+05,5,1,4,514,Promising,5
153466,4845514,252,1,5.030583e+04,4,1,1,411,New Customers,4

In [19]:
# saving the final result in feathers and csv format
rfm_df.to_feather("assets/rfm-scores.feather")
rfm_df.to_csv("assets/rfm-scores.csv")